app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "abc"], ["password_digest", "$2a$12$9DWob9gHctWJeNxYQSi2LucCRea0c5FxydS5i15ghbB5rTKyEyoMC"], ["created_at", "2021-11-09 17:56:48.147402"], ["updated_at", "2021-11-09 17:56:48.147402"]]
---
	def create
		@user = User.new(user_params)
		if @user.save