app/controllers/welcome_controller.rb

SELECT "projects".* FROM "projects" INNER JOIN "users" ON "users"."id" = "projects"."user_id" LEFT OUTER JOIN "categories" ON "categories"."id" = "projects"."category_id" ORDER BY "projects"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "projects" INNER JOIN "users" ON "users"."id" = "projects"."user_id" LEFT OUTER JOIN "categories" ON "categories"."id" = "projects"."category_id"
---
  def index
    @projects = Project.joins(:user).left_joins(:category).order(created_at: :desc).paginate(page: params[:page], per_page: 2)