app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "abc"], ["LIMIT", 1]]
---
	def self.authenticate(username, password)
		user = User.find_by(username: username).try(:authenticate, password)